using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Data.Entity;

namespace Blog.Models
{
    public class ArticleDbInitializer : DropCreateDatabaseAlways<BlogContext>
    {
        protected override void Seed(BlogContext context)
        {
            context.Articles.Add(new Article { Name = "Украинская теннисистка выиграла престижный турнир", Text = "Украинская теннисистка Леся Цуренко стала победительницей турнира WTA Guangzhou International Women's Open в китайском Гуанчжоу. В финальном поединке Цуренко обыграла бывшую первую ракетку мира, спортсменку из Сербии Елену Янкович (6:4, 3:6 и 6:4). Как уточняет 'ДС', oткрытый чемпионат Гуанчжоу - женский профессиональный международный теннисный турнир, проходящий осенью в китайском Гуанчжоу на хардовых кортах. С 2009 года относится к международной серии WTA с призовым фондом 250 тысяч долларов и турнирной сеткой, рассчитанной на 32 участника в одиночном разряде и 16 пар.", PublicationTime = "24/09/2016" });
            context.Articles.Add( new Article { Name = "Правительство пообещало обеспечить стипендиями всех студентов", Text = "Правительство предусмотрело в проекте государственного бюджета на 2017 год увеличение расходов на оплату стипендий более чем на 500 млн грн, что позволит обеспечить стипендиями всех студентов. 'Мы сегодня в проекте бюджета на 2017 год также увеличили расходы на оплату стипендий более чем на 500 млн грн.Это значит, что мы покроем стипендиями всех тех, кто имеет на них право', - заявил Гройсман.", PublicationTime = "24/09/2016" } );
            context.Articles.Add(new Article { Name = "Все украинские результаты Олимпиады-2016 в Рио", Text = "Украинские спортсмены завоевали 11 медалей: 'золото' у Олега Верняева и Юрия Чебана, 'серебро' у Олега Верняева, Павла Тимощенко, Сергея Кулиша, Жана Беленюка и женской сборной по фехтованию на саблях, 'бронза' – у Ольги Харлан, Богдана Бондаренко, Анны Ризатдиновой и каноэ-двойки Тарас Мищук / Дмитрий Янчук.", PublicationTime = "24/09/2016" });
            context.Articles.Add(new Article { Name = "Погода в Украине", Text = "Погода на сегодня: 25 сентября 2016 года на территории Украины ожидаются дожди, на западе и юге с грозами, температура воздуха днем от +12 до +19, ветер северный, северо-западный до 10-12 м/с. Об этом сообщает Гидрометцентр при ГСЧС Украины. По данным синоптиков, на востоке страны воздух прогреется до +14, на юге будет теплее – до +19. Сравнительно такая же температура ожидается в западных регионах, где столбики термометров будут показывать от +14 до +19. В центральных областях страны дневная температура составит от +15 до +18, в северной части Украины от +13 до +18. Кроме того, 25 сентября в большинстве районов Сумской, Винницкой, Черкасской, Полтавской и Кировоградской областей сохранится чрезвычайная пожарная опасность.", PublicationTime = "23/09/2016" });
            base.Seed(context);
        }
    }
}